#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.scaleway_domain_zone.hollynetes: Reading...
scaleway_registry_namespace.app_namespace: Refreshing state... [id=fr-par/0bd3e20d-2307-4ae7-9558-5ed1db849044]
scaleway_k8s_pool.api_pool: Refreshing state... [id=fr-par/bdc2a8f9-2876-4521-b2ec-d4e5070d7caa]
scaleway_vpc_private_network.main_network: Refreshing state... [id=fr-par/ddfd9871-5cbd-4e3f-a61f-775e7daf3388]
data.scaleway_domain_zone.hollynetes: Read complete after 1s [id=.hollynetes.fr]
scaleway_k8s_cluster.main_cluster: Refreshing state... [id=fr-par/c55a04e3-490e-49f1-96e2-24e133a9cec6]
helm_release.ingress: Refreshing state... [id=ingress]
kubernetes_secret.tls_cert: Refreshing state... [id=default/tls-cert]
kubernetes_deployment.frontend: Refreshing state... [id=default/frontend-deployment]
kubernetes_deployment.backend: Refreshing state... [id=default/backend-deployment]
kubernetes_deployment.mongodb: Refreshing state... [id=default/mongodb-deployment]
kubernetes_service.backend: Refreshing state... [id=default/backend-service]
kubernetes_service.mongodb: Refreshing state... [id=default/mongodb-service]
kubernetes_service.frontend: Refreshing state... [id=default/frontend-service]
kubernetes_ingress_v1.app_ingress_static: Refreshing state... [id=default/app-ingress-static]
kubernetes_ingress_v1.app_ingress: Refreshing state... [id=default/app-ingress]
scaleway_domain_record.hollynetes: Refreshing state... [id=58e4750f-bd8a-4c98-9d34-5f5ed9dd3d77]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # kubernetes_deployment.backend will be updated in-place
  ~ resource "kubernetes_deployment" "backend" {
        id               = "default/backend-deployment"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ spec {
                    # (12 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "rg.fr-par.scw.cloud/app-namespace/backend:sha-20b5c3f" -> "rg.fr-par.scw.cloud/app-namespace/backend:sha-7a781b7"
                        name                       = "backend-container"
                        # (8 unchanged attributes hidden)

                        # (3 unchanged blocks hidden)
                    }
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_deployment.frontend will be updated in-place
  ~ resource "kubernetes_deployment" "frontend" {
        id               = "default/frontend-deployment"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ spec {
                    # (12 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "rg.fr-par.scw.cloud/app-namespace/frontend:sha-20b5c3f" -> "rg.fr-par.scw.cloud/app-namespace/frontend:sha-7a781b7"
                        name                       = "frontend-container"
                        # (8 unchanged attributes hidden)

                        # (2 unchanged blocks hidden)
                    }
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # scaleway_k8s_pool.api_pool will be destroyed
  # (because scaleway_k8s_pool.api_pool is not in configuration)
  - resource "scaleway_k8s_pool" "api_pool" {
      - autohealing         = false -> null
      - autoscaling         = false -> null
      - cluster_id          = "fr-par/c55a04e3-490e-49f1-96e2-24e133a9cec6" -> null
      - container_runtime   = "containerd" -> null
      - created_at          = "2023-11-30T01:37:21Z" -> null
      - current_size        = 1 -> null
      - id                  = "fr-par/bdc2a8f9-2876-4521-b2ec-d4e5070d7caa" -> null
      - kubelet_args        = {} -> null
      - max_size            = 1 -> null
      - min_size            = 1 -> null
      - name                = "api-pool" -> null
      - node_type           = "dev1_m" -> null
      - nodes               = [
          - {
              - name         = "scw-main-cluster-api-pool-527d4be6e1464f21b8e5"
              - public_ip    = "51.15.138.204"
              - public_ip_v6 = ""
              - status       = "ready"
            },
        ] -> null
      - public_ip_disabled  = false -> null
      - size                = 1 -> null
      - status              = "ready" -> null
      - tags                = [] -> null
      - updated_at          = "2023-11-30T01:46:15Z" -> null
      - version             = "1.28.2" -> null
      - wait_for_pool_ready = true -> null
      - zone                = "fr-par-1" -> null

      - upgrade_policy {
          - max_surge       = 0 -> null
          - max_unavailable = 1 -> null
        }
    }

  # scaleway_k8s_pool.main_pool will be created
  + resource "scaleway_k8s_pool" "main_pool" {
      + autohealing         = false
      + autoscaling         = false
      + cluster_id          = "fr-par/c55a04e3-490e-49f1-96e2-24e133a9cec6"
      + container_runtime   = "containerd"
      + created_at          = (known after apply)
      + current_size        = (known after apply)
      + id                  = (known after apply)
      + max_size            = (known after apply)
      + min_size            = 1
      + name                = "main-pool"
      + node_type           = "DEV1-M"
      + nodes               = (known after apply)
      + public_ip_disabled  = false
      + region              = (known after apply)
      + size                = 1
      + status              = (known after apply)
      + updated_at          = (known after apply)
      + version             = (known after apply)
      + wait_for_pool_ready = true
      + zone                = (known after apply)
    }

  # scaleway_vpc_private_network.main_network will be updated in-place
  ~ resource "scaleway_vpc_private_network" "main_network" {
        id              = "fr-par/ddfd9871-5cbd-4e3f-a61f-775e7daf3388"
        name            = "main-network"
      ~ tags            = [
          - "api",
          - "database",
            "terraform",
          + "main",
        ]
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Loic-Vanden-Bossche, Action: `pull_request`*